# Pandas

Customarily, we import as follows -

In [1]:
import numpy as np
import pandas as pd

# Basic Data Structures

Pandas provides two types of classes for handling data -

1. Series - 1-D labeled array holding data of any type (such as integers, strings etc.)
2. DataFrame - 2-D array that holds data like a table with rows and columns

# Object Creation

Creating a Series by passing a list of values

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

Creating a DataFrame by passing a NumPy array with datetime index

In [3]:
dates = pd.date_range("20130101", periods = 6)

df = pd.DataFrame(np.random.randn(6, 4), index = dates, columns = list("ABCD"))
df

                   A         B         C         D
2013-01-01  1.100156  1.153545  0.073034  1.343908
2013-01-02 -1.285799  1.229948 -0.736759 -1.079721
2013-01-03 -0.605377  1.175400  1.594911 -0.324220
2013-01-04 -0.187887 -0.683954 -0.520152  0.239261
2013-01-05 -1.367260  0.276128 -1.230104  0.421988
2013-01-06 -1.290331 -2.079122 -0.468033 -1.312278

By passing a dictionary of objects where the keys are the column labels and the values are the columns values

In [4]:
df2 = pd.DataFrame(
    {
        "A" : 1.0,
        "B" : pd.Timestamp("20130102"),
        "C" : pd.Series(1, index = list(range(4)), dtype = "float32"),
        "D" : np.array([3] * 4, dtype = "int32"),
        "E" : pd.Categorical(["test", "train", "test", "train"]),
        "F" : "foo"
    }
)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

Columns of the resulting DataFrame have different dtypes -

In [5]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

# Viewing Data

Use DataFrame.head() and DataFrame.tail() to view the top and bottom rows of the frame -

In [6]:
df.head()

                   A         B         C         D
2013-01-01  1.100156  1.153545  0.073034  1.343908
2013-01-02 -1.285799  1.229948 -0.736759 -1.079721
2013-01-03 -0.605377  1.175400  1.594911 -0.324220
2013-01-04 -0.187887 -0.683954 -0.520152  0.239261
2013-01-05 -1.367260  0.276128 -1.230104  0.421988

In [7]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.187887 -0.683954 -0.520152  0.239261
2013-01-05 -1.367260  0.276128 -1.230104  0.421988
2013-01-06 -1.290331 -2.079122 -0.468033 -1.312278

Display the DataFrame.index or DataFrame.columns -

In [8]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [9]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

Return a NumPy representation of the underlying data with DataFrame.to_numpy() without the index or column labels -

In [10]:
df.to_numpy()

array([[ 1.10015628,  1.15354454,  0.07303447,  1.34390775],
       [-1.28579913,  1.22994771, -0.73675937, -1.07972107],
       [-0.60537658,  1.1754003 ,  1.59491078, -0.32421959],
       [-0.18788732, -0.68395356, -0.52015168,  0.23926108],
       [-1.36725973,  0.27612822, -1.2301044 ,  0.42198831],
       [-1.29033134, -2.07912166, -0.46803328, -1.31227754]])

Note

NumPy arrays have one dtype for the entire array while pandas DataFrame have one dtype per column. When we call DataFrame.to_numpy(), pandas will find the NumPy dtype that can hold all of the dtypes in the DataFrame. If the common data type is object, DataFrame.to_numpy() will require copying data.

In [11]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [12]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

describe() shows a quick statistic summary of your data -

In [13]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.606083  0.178658 -0.214517 -0.118510
std    0.958722  1.334187  0.981688  0.995000
min   -1.367260 -2.079122 -1.230104 -1.312278
25%   -1.289198 -0.443933 -0.682607 -0.890846
50%   -0.945588  0.714836 -0.494092 -0.042479
75%   -0.292260  1.169936 -0.062232  0.376306
max    1.100156  1.229948  1.594911  1.343908

Transposing your data -

In [14]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.100156   -1.285799   -0.605377   -0.187887   -1.367260   -1.290331
B    1.153545    1.229948    1.175400   -0.683954    0.276128   -2.079122
C    0.073034   -0.736759    1.594911   -0.520152   -1.230104   -0.468033
D    1.343908   -1.079721   -0.324220    0.239261    0.421988   -1.312278

DataFrame.sort_index() sorts by an axis -

In [15]:
df.sort_index(axis = 1, ascending = False)

                   D         C         B         A
2013-01-01  1.343908  0.073034  1.153545  1.100156
2013-01-02 -1.079721 -0.736759  1.229948 -1.285799
2013-01-03 -0.324220  1.594911  1.175400 -0.605377
2013-01-04  0.239261 -0.520152 -0.683954 -0.187887
2013-01-05  0.421988 -1.230104  0.276128 -1.367260
2013-01-06 -1.312278 -0.468033 -2.079122 -1.290331

DataFrame.sort_values() sorts by values

In [16]:
df.sort_values(by = "B")

                   A         B         C         D
2013-01-06 -1.290331 -2.079122 -0.468033 -1.312278
2013-01-04 -0.187887 -0.683954 -0.520152  0.239261
2013-01-05 -1.367260  0.276128 -1.230104  0.421988
2013-01-01  1.100156  1.153545  0.073034  1.343908
2013-01-03 -0.605377  1.175400  1.594911 -0.324220
2013-01-02 -1.285799  1.229948 -0.736759 -1.079721

# Selection

Note

While standard Python/NumPy expressions for selecting and setting are intuitive and come in handy for interactive work, for production code, it is recommeded the optimized pandas data access methods, DataFrame.at(), DataFrame.iat(), DataFrame.loc() and DataFrame.iloc()

# Getitem ([])

For a DataFrame, passing a single label selects a column and yields a Series equivalent to df.A -

In [17]:
df["A"]

2013-01-01    1.100156
2013-01-02   -1.285799
2013-01-03   -0.605377
2013-01-04   -0.187887
2013-01-05   -1.367260
2013-01-06   -1.290331
Freq: D, Name: A, dtype: float64

For a DataFrame, passing a slice : selects matching rows -

In [18]:
df[0:3]

                   A         B         C         D
2013-01-01  1.100156  1.153545  0.073034  1.343908
2013-01-02 -1.285799  1.229948 -0.736759 -1.079721
2013-01-03 -0.605377  1.175400  1.594911 -0.324220

In [19]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -1.285799  1.229948 -0.736759 -1.079721
2013-01-03 -0.605377  1.175400  1.594911 -0.324220
2013-01-04 -0.187887 -0.683954 -0.520152  0.239261

# Selection by label

Selecting a row matching a label -

In [20]:
df.loc[dates[0]]

A    1.100156
B    1.153545
C    0.073034
D    1.343908
Name: 2013-01-01 00:00:00, dtype: float64

Selecting all rows (:) with a select column labels -

In [21]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  1.100156  1.153545
2013-01-02 -1.285799  1.229948
2013-01-03 -0.605377  1.175400
2013-01-04 -0.187887 -0.683954
2013-01-05 -1.367260  0.276128
2013-01-06 -1.290331 -2.079122

For label slicing, both endpoints are included -

In [22]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02 -1.285799  1.229948
2013-01-03 -0.605377  1.175400
2013-01-04 -0.187887 -0.683954

Selecting a single row and column label returns a scalar -

In [23]:
df.loc[dates[0], "A"]

np.float64(1.1001562764371455)

For getting fast access to a scalar (equivalent to the prior method) -

In [24]:
df.at[dates[0], "A"]

np.float64(1.1001562764371455)

# Selection by Position

Select via the position of the passed integers -

In [25]:
df.iloc[3]

A   -0.187887
B   -0.683954
C   -0.520152
D    0.239261
Name: 2013-01-04 00:00:00, dtype: float64

Integer slices acts similar to NumPy/Python -

In [26]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.187887 -0.683954
2013-01-05 -1.367260  0.276128

List of integer position locations -

In [27]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -1.285799 -0.736759
2013-01-03 -0.605377  1.594911
2013-01-05 -1.367260 -1.230104

For slicing rows explicitly -

In [28]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -1.285799  1.229948 -0.736759 -1.079721
2013-01-03 -0.605377  1.175400  1.594911 -0.324220

Slicing columns explicitly -

In [29]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  1.153545  0.073034
2013-01-02  1.229948 -0.736759
2013-01-03  1.175400  1.594911
2013-01-04 -0.683954 -0.520152
2013-01-05  0.276128 -1.230104
2013-01-06 -2.079122 -0.468033


For getting a value explicitly -

In [30]:
df.iloc[1, 1]

np.float64(1.2299477053274959)

For faster access to a scalar (equivalent to the prior method) -

In [31]:
df.iat[1, 1]

np.float64(1.2299477053274959)

# Boolean Indexing

Select rows where df.A is greater than 0

In [32]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-01  1.100156  1.153545  0.073034  1.343908

Selecting values from a DataFrame where a Boolean condition is met -

In [33]:
df[df > 0]

                   A         B         C         D
2013-01-01  1.100156  1.153545  0.073034  1.343908
2013-01-02       NaN  1.229948       NaN       NaN
2013-01-03       NaN  1.175400  1.594911       NaN
2013-01-04       NaN       NaN       NaN  0.239261
2013-01-05       NaN  0.276128       NaN  0.421988
2013-01-06       NaN       NaN       NaN       NaN

Using isin() method for filtering -

In [34]:
df2 = df.copy()
df2["E"] = ["one", "one", "two", "three", "four", "three"]
df2

                   A         B         C         D      E
2013-01-01  1.100156  1.153545  0.073034  1.343908    one
2013-01-02 -1.285799  1.229948 -0.736759 -1.079721    one
2013-01-03 -0.605377  1.175400  1.594911 -0.324220    two
2013-01-04 -0.187887 -0.683954 -0.520152  0.239261  three
2013-01-05 -1.367260  0.276128 -1.230104  0.421988   four
2013-01-06 -1.290331 -2.079122 -0.468033 -1.312278  three

# Setting

Setting a new column automatically aligns the data by the indexes -

In [35]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index = pd.date_range("20130102", periods = 6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [36]:
df["F"] = s1

Setting values by label -

In [37]:
df.at[dates[0], "A"] = 0

By position -

In [38]:
df.iat[0, 1] = 0

By assigning with a NumPy array -

In [39]:
df.loc[:, "D"] = np.array([5] * len(df))

Result -

In [40]:
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000  0.073034  5.0  NaN
2013-01-02 -1.285799  1.229948 -0.736759  5.0  1.0
2013-01-03 -0.605377  1.175400  1.594911  5.0  2.0
2013-01-04 -0.187887 -0.683954 -0.520152  5.0  3.0
2013-01-05 -1.367260  0.276128 -1.230104  5.0  4.0
2013-01-06 -1.290331 -2.079122 -0.468033  5.0  5.0

# Missing Data

For NumPy data types, np.nan represents missing data. It is by default not included in computations.

Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data -

In [41]:
df1 = df.reindex(index = dates[0:4], columns = list(df.columns) + ["E"])
df1.loc[dates[0] : dates[1], "E"] = 1
df1

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000  0.073034  5.0  NaN  1.0
2013-01-02 -1.285799  1.229948 -0.736759  5.0  1.0  1.0
2013-01-03 -0.605377  1.175400  1.594911  5.0  2.0  NaN
2013-01-04 -0.187887 -0.683954 -0.520152  5.0  3.0  NaN

DataFrame.dropna() drops any rows that have missing data -

In [42]:
df1.dropna(how = "any")

                   A         B         C    D    F    E
2013-01-02 -1.285799  1.229948 -0.736759  5.0  1.0  1.0

DataFrame.fillna() fills missing data -

In [43]:
df1.fillna(value = 5)

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000  0.073034  5.0  5.0  1.0
2013-01-02 -1.285799  1.229948 -0.736759  5.0  1.0  1.0
2013-01-03 -0.605377  1.175400  1.594911  5.0  2.0  5.0
2013-01-04 -0.187887 -0.683954 -0.520152  5.0  3.0  5.0

isna() gets the Boolean mask where values are nan -

In [44]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True